#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//int main()
//{
//	int a = 5 / 2;
//	printf("a=%d\n", a);
//
//	return 0;
//}

//右移操作符：
//1.算术右移——右边丢弃，左边补原符号位
//2.逻辑右移——右边丢弃，左边补0

//int main()
//{
//	int a = 16;
//	//>>  --右移操作符
//	//移动的是二进制位
//	int b = a >> 1;
//    
//	printf("a=%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	//>>  --右移操作符
//	//整数的二进制表示有：原码、反码、补码
//	//存储到内存中的是补码
//	//10000000 00000000 00000000 00000001 --原码
//	//11111111 11111111 11111111 11111110 --反码
//	//11111111 11111111 11111111 11111111 --补码=反码加一
//	//
//	int b = a >> 1;
//
//	printf("a=%d\n", b);
//	return 0;
//}

//左移操作符
//左边丢弃，右边补0；
//int main()
//{
//	int a = 5;
//	int b = a << 1;
//	return 0;
//}

//
//int main()
//{
//	/*
//	int a = 3;
//	int b = 5;
//	int c = a & b;
//	//00000000 00000000 00000000 00000011
//	//00000000 00000000 00000000 00000101
//	//00000000 00000000 00000000 00000001
//	*/
//
//	int a = 3;
//	int b = 5;
//	int c = a | b;
//	printf("c=%d\n", c);
//	//00000000 00000000 00000000 00000011
//	//00000000 00000000 00000000 00000101
//	//00000000 00000000 00000000 00000111
//
//	return 0;
//}
//

//int main()
//{
//	int a = 3;
//	int b = 5;
//	int tmp = 0;
//	printf("before:a=%d b=%d\n", a, b);
//	//tmp = a;
//	//a = b;
//	//b = tmp;
//
//	//加减法：
//	/*
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	*/
//	//上述方法有缺陷，可能会溢出。
//
//	//异或的方法：
//	//3和5异或产生一个密码；
//	//这个密码可以再次和3异或产生一个5;
//	//这个密码可以再次和5异或产生一个3
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//
//	printf("after:a=%d b=%d\n", a, b);
//
//
//	return 0;
//}


int main()
{
	int num = 0;
	int count = 0;
	int i = 0;
	scanf("%d", &num); //3 011
	//统计num的补码中有几个1
	/*
	while (num)
	{
		if (num % 2 == 1)
			count++;
		num = num / 2;
	}*/
	//负数出现了问题
	for (i = 0; i < 32; i++)
	{
		if (1 == ((num >> i) & 1))
			count++;
	}
	printf("%d\n", count);
	return 0;
}
